Revit 2026 API

# RadioButtonGroupData Constructor

---

Constructs a new instance of RadioButtonGroupData.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RadioButtonGroupData(
	string name
)
```
```vb
Public Sub New (
	name As String
)
```
```cpp
public:
RadioButtonGroupData(
	String^ name
)
```
```fsharp
new :
        name : string -> RadioButtonGroupData
```

#### Parameters

name String
    The internal name of the RadioButtonGroup.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is passed for name. |
| ArgumentException | Thrown when an empty string is passed for name. |

#### Reference

RadioButtonGroupData Class

Autodesk.Revit.UI Namespace